FI/Laboratoriotiedot/Integraatiopalvelu_Laboratoriotiedot_Palvelukuvaus_1.0.wsdl

<?xml version="1.0" encoding="utf-8"?><wsdl:definitions name="LaboratoryService" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:tns="http://tempuri.org/" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><wsdl:types><xs:schema elementFormDefault="qualified" targetNamespace="http://tempuri.org/" xmlns:xs="http://www.w3.org/2001/XMLSchema"><xs:import namespace="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon"/><xs:import namespace="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.Laboratory.DataContracts"/><xs:element name="GetLaboratoryDataRequest"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="MessageHeader" nillable="true" type="q1:MessageHeader" xmlns:q1="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon"/><xs:element minOccurs="0" name="Common" nillable="true" type="q2:LisCommon" xmlns:q2="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon"/><xs:element minOccurs="0" name="LaboratoryRequest" nillable="true" type="q3:LaboratoryRequest" xmlns:q3="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.Laboratory.DataContracts"/></xs:sequence></xs:complexType></xs:element><xs:element name="GetLaboratoryDataResponse"><xs:complexType><xs:sequence><xs:element minOccurs="0" name="AcknowledgeRequestStatus" nillable="true" type="q4:AcknowledgeRequestStatus" xmlns:q4="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon"/><xs:element minOccurs="0" name="MessageHeader" nillable="true" type="q5:MessageHeader" xmlns:q5="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon"/><xs:element minOccurs="0" name="PatientId" nillable="true" type="q6:PatientId" xmlns:q6="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.Laboratory.DataContracts"/><xs:element minOccurs="0" name="LaboratoryResults" nillable="true" type="q7:ArrayOfLaboratoryResult" xmlns:q7="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.Laboratory.DataContracts"/></xs:sequence></xs:complexType></xs:element></xs:schema><xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/"><xs:element name="anyType" nillable="true" type="xs:anyType"/><xs:element name="anyURI" nillable="true" type="xs:anyURI"/><xs:element name="base64Binary" nillable="true" type="xs:base64Binary"/><xs:element name="boolean" nillable="true" type="xs:boolean"/><xs:element name="byte" nillable="true" type="xs:byte"/><xs:element name="dateTime" nillable="true" type="xs:dateTime"/><xs:element name="decimal" nillable="true" type="xs:decimal"/><xs:element name="double" nillable="true" type="xs:double"/><xs:element name="float" nillable="true" type="xs:float"/><xs:element name="int" nillable="true" type="xs:int"/><xs:element name="long" nillable="true" type="xs:long"/><xs:element name="QName" nillable="true" type="xs:QName"/><xs:element name="short" nillable="true" type="xs:short"/><xs:element name="string" nillable="true" type="xs:string"/><xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte"/><xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt"/><xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong"/><xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort"/><xs:element name="char" nillable="true" type="tns:char"/><xs:simpleType name="char"><xs:restriction base="xs:int"/></xs:simpleType><xs:element name="duration" nillable="true" type="tns:duration"/><xs:simpleType name="duration"><xs:restriction base="xs:duration"><xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?"/><xs:minInclusive value="-P10675199DT2H48M5.4775808S"/><xs:maxInclusive value="P10675199DT2H48M5.4775807S"/></xs:restriction></xs:simpleType><xs:element name="guid" nillable="true" type="tns:guid"/><xs:simpleType name="guid"><xs:restriction base="xs:string"><xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}"/></xs:restriction></xs:simpleType><xs:attribute name="FactoryType" type="xs:QName"/><xs:attribute name="Id" type="xs:ID"/><xs:attribute name="Ref" type="xs:IDREF"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon"><xs:complexType name="MessageHeader"><xs:sequence><xs:element minOccurs="0" name="MessageID" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="TransactionID" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="SenderID" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="SenderApplication" nillable="true" type="xs:string"/><xs:element name="ReceiverID" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="ReceiverApplication" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="CharacterSet" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="DataServiceURL" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="UserLanguageCode" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="VersionNumber" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="MessageHeader" nillable="true" type="tns:MessageHeader"/><xs:complexType name="LisCommon"><xs:sequence><xs:element minOccurs="0" name="ContractKey" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="UserId" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="CallingSystem" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="CallingUserId" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="LisCommon" nillable="true" type="tns:LisCommon"/><xs:complexType name="AcknowledgeRequestStatus"><xs:sequence><xs:element minOccurs="0" name="HasOperationFailed" type="xs:boolean"/><xs:element minOccurs="0" name="ErrorType" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="ErrorMessage" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="AcknowledgeRequestStatus" nillable="true" type="tns:AcknowledgeRequestStatus"/><xs:complexType name="LisFaultInfo"><xs:sequence><xs:element minOccurs="0" name="Description" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="Message" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="LisFaultInfo" nillable="true" type="tns:LisFaultInfo"/></xs:schema><xs:schema elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.Laboratory.DataContracts" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.Laboratory.DataContracts"><xs:complexType name="LaboratoryRequest"><xs:sequence><xs:element minOccurs="0" name="Organisation" nillable="true" type="tns:Code"><xs:annotation><xs:appinfo><DefaultValue EmitDefaultValue="false" xmlns="http://schemas.microsoft.com/2003/10/Serialization/"/></xs:appinfo></xs:annotation></xs:element><xs:element minOccurs="0" name="Area" nillable="true" type="tns:Code"><xs:annotation><xs:appinfo><DefaultValue EmitDefaultValue="false" xmlns="http://schemas.microsoft.com/2003/10/Serialization/"/></xs:appinfo></xs:annotation></xs:element><xs:element name="PatientId" nillable="true" type="tns:PatientId"/><xs:element name="EffectiveTime" nillable="true" type="tns:EffectiveTime"/></xs:sequence></xs:complexType><xs:element name="LaboratoryRequest" nillable="true" type="tns:LaboratoryRequest"/><xs:complexType name="Code"><xs:sequence><xs:element minOccurs="0" name="CodeSetName" nillable="true" type="xs:string"><xs:annotation><xs:appinfo><DefaultValue EmitDefaultValue="false" xmlns="http://schemas.microsoft.com/2003/10/Serialization/"/></xs:appinfo></xs:annotation></xs:element><xs:element minOccurs="0" name="CodeSetId" nillable="true" type="xs:string"><xs:annotation><xs:appinfo><DefaultValue EmitDefaultValue="false" xmlns="http://schemas.microsoft.com/2003/10/Serialization/"/></xs:appinfo></xs:annotation></xs:element><xs:element minOccurs="0" name="CodeValue" nillable="true" type="xs:string"><xs:annotation><xs:appinfo><DefaultValue EmitDefaultValue="false" xmlns="http://schemas.microsoft.com/2003/10/Serialization/"/></xs:appinfo></xs:annotation></xs:element><xs:element minOccurs="0" name="CodeDescription" nillable="true" type="xs:string"><xs:annotation><xs:appinfo><DefaultValue EmitDefaultValue="false" xmlns="http://schemas.microsoft.com/2003/10/Serialization/"/></xs:appinfo></xs:annotation></xs:element></xs:sequence></xs:complexType><xs:element name="Code" nillable="true" type="tns:Code"/><xs:complexType name="PatientId"><xs:sequence><xs:element name="Identifier" nillable="true" type="xs:string"/></xs:sequence></xs:complexType><xs:element name="PatientId" nillable="true" type="tns:PatientId"/><xs:complexType name="EffectiveTime"><xs:sequence><xs:element name="StartDateTime" type="xs:dateTime"/><xs:element name="EndDateTime" type="xs:dateTime"/></xs:sequence></xs:complexType><xs:element name="EffectiveTime" nillable="true" type="tns:EffectiveTime"/><xs:complexType name="ArrayOfLaboratoryResult"><xs:sequence><xs:element minOccurs="0" maxOccurs="unbounded" name="LaboratoryResult" nillable="true" type="tns:LaboratoryResult"/></xs:sequence></xs:complexType><xs:element name="ArrayOfLaboratoryResult" nillable="true" type="tns:ArrayOfLaboratoryResult"/><xs:complexType name="LaboratoryResult"><xs:sequence><xs:element name="Id" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="LaboratoryReferral" nillable="true" type="tns:LaboratoryReferral"><xs:annotation><xs:appinfo><DefaultValue EmitDefaultValue="false" xmlns="http://schemas.microsoft.com/2003/10/Serialization/"/></xs:appinfo></xs:annotation></xs:element><xs:element minOccurs="0" name="SamplingCareunit" nillable="true" type="tns:Code"><xs:annotation><xs:appinfo><DefaultValue EmitDefaultValue="false" xmlns="http://schemas.microsoft.com/2003/10/Serialization/"/></xs:appinfo></xs:annotation></xs:element><xs:element minOccurs="0" name="OrderingCareunit" nillable="true" type="tns:Code"><xs:annotation><xs:appinfo><DefaultValue EmitDefaultValue="false" xmlns="http://schemas.microsoft.com/2003/10/Serialization/"/></xs:appinfo></xs:annotation></xs:element><xs:element name="LaboratoryTest" nillable="true" type="tns:Code"/><xs:element name="SamplingDateTime" type="xs:dateTime"/><xs:element name="AnswerDateTime" type="xs:dateTime"/><xs:element name="Result" nillable="true" type="tns:Result"/><xs:element name="ReferenceValue" nillable="true" type="tns:ReferenceValue"/><xs:element minOccurs="0" name="Statement" nillable="true" type="tns:Statement"><xs:annotation><xs:appinfo><DefaultValue EmitDefaultValue="false" xmlns="http://schemas.microsoft.com/2003/10/Serialization/"/></xs:appinfo></xs:annotation></xs:element></xs:sequence></xs:complexType><xs:element name="LaboratoryResult" nillable="true" type="tns:LaboratoryResult"/><xs:complexType name="LaboratoryReferral"><xs:sequence><xs:element minOccurs="0" name="Id" nillable="true" type="xs:string"/><xs:element minOccurs="0" name="ReferralDateTime" type="xs:dateTime"/></xs:sequence></xs:complexType><xs:element name="LaboratoryReferral" nillable="true" type="tns:LaboratoryReferral"/><xs:complexType name="Result"><xs:sequence><xs:element minOccurs="0" name="Value" nillable="true" type="xs:string"><xs:annotation><xs:appinfo><DefaultValue EmitDefaultValue="false" xmlns="http://schemas.microsoft.com/2003/10/Serialization/"/></xs:appinfo></xs:annotation></xs:element><xs:element minOccurs="0" name="Unit" nillable="true" type="xs:string"><xs:annotation><xs:appinfo><DefaultValue EmitDefaultValue="false" xmlns="http://schemas.microsoft.com/2003/10/Serialization/"/></xs:appinfo></xs:annotation></xs:element></xs:sequence></xs:complexType><xs:element name="Result" nillable="true" type="tns:Result"/><xs:complexType name="ReferenceValue"><xs:sequence><xs:element minOccurs="0" name="Text" nillable="true" type="xs:string"><xs:annotation><xs:appinfo><DefaultValue EmitDefaultValue="false" xmlns="http://schemas.microsoft.com/2003/10/Serialization/"/></xs:appinfo></xs:annotation></xs:element><xs:element minOccurs="0" name="Low" nillable="true" type="xs:string"><xs:annotation><xs:appinfo><DefaultValue EmitDefaultValue="false" xmlns="http://schemas.microsoft.com/2003/10/Serialization/"/></xs:appinfo></xs:annotation></xs:element><xs:element minOccurs="0" name="High" nillable="true" type="xs:string"><xs:annotation><xs:appinfo><DefaultValue EmitDefaultValue="false" xmlns="http://schemas.microsoft.com/2003/10/Serialization/"/></xs:appinfo></xs:annotation></xs:element></xs:sequence></xs:complexType><xs:element name="ReferenceValue" nillable="true" type="tns:ReferenceValue"/><xs:complexType name="Statement"><xs:sequence><xs:element minOccurs="0" name="Text" nillable="true" type="xs:string"><xs:annotation><xs:appinfo><DefaultValue EmitDefaultValue="false" xmlns="http://schemas.microsoft.com/2003/10/Serialization/"/></xs:appinfo></xs:annotation></xs:element></xs:sequence></xs:complexType><xs:element name="Statement" nillable="true" type="tns:Statement"/></xs:schema></wsdl:types><wsdl:message name="GetLaboratoryDataRequest"><wsdl:part name="parameters" element="tns:GetLaboratoryDataRequest"/></wsdl:message><wsdl:message name="GetLaboratoryDataResponse"><wsdl:part name="parameters" element="tns:GetLaboratoryDataResponse"/></wsdl:message><wsdl:message name="ILaboratoryService_GetPatientLaboratoryResults_LisFaultInfoFault_FaultMessage"><wsdl:part name="detail" element="q1:LisFaultInfo" xmlns:q1="http://schemas.datacontract.org/2004/07/Tieto.HCW.EIS.LISCommon"/></wsdl:message><wsdl:portType name="ILaboratoryService"><wsdl:operation name="GetPatientLaboratoryResults"><wsdl:input wsaw:Action="http://tempuri.org/ILaboratoryService/GetPatientLaboratoryResults" name="GetLaboratoryDataRequest" message="tns:GetLaboratoryDataRequest"/><wsdl:output wsaw:Action="http://tempuri.org/ILaboratoryService/GetPatientLaboratoryResultsResponse" name="GetLaboratoryDataResponse" message="tns:GetLaboratoryDataResponse"/><wsdl:fault wsaw:Action="http://tempuri.org/ILaboratoryService/GetPatientLaboratoryResultsLisFaultInfoFault" name="LisFaultInfoFault" message="tns:ILaboratoryService_GetPatientLaboratoryResults_LisFaultInfoFault_FaultMessage"/></wsdl:operation></wsdl:portType><wsdl:binding name="BasicHttpBinding_ILaboratoryService" type="tns:ILaboratoryService"><soap:binding transport="http://schemas.xmlsoap.org/soap/http"/><wsdl:operation name="GetPatientLaboratoryResults"><soap:operation soapAction="http://tempuri.org/ILaboratoryService/GetPatientLaboratoryResults" style="document"/><wsdl:input name="GetLaboratoryDataRequest"><soap:body use="literal"/></wsdl:input><wsdl:output name="GetLaboratoryDataResponse"><soap:body use="literal"/></wsdl:output><wsdl:fault name="LisFaultInfoFault"><soap:fault use="literal" name="LisFaultInfoFault" namespace=""/></wsdl:fault></wsdl:operation></wsdl:binding><wsdl:service name="LaboratoryService"><wsdl:port name="BasicHttpBinding_ILaboratoryService" binding="tns:BasicHttpBinding_ILaboratoryService"><soap:address location="http://localhost:13630/LaboratoryService.svc"/></wsdl:port></wsdl:service></wsdl:definitions>